MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx270f512l.h
#define _AD1CSSL2_CSSL41_POSITION                0x00000009
#define _AD1CSSL2_CSSL41_MASK                    0x00000200
#define _AD1CSSL2_CSSL41_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL42_POSITION                0x0000000A
#define _AD1CSSL2_CSSL42_MASK                    0x00000400
#define _AD1CSSL2_CSSL42_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL43_POSITION                0x0000000B
#define _AD1CSSL2_CSSL43_MASK                    0x00000800
#define _AD1CSSL2_CSSL43_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL44_POSITION                0x0000000C
#define _AD1CSSL2_CSSL44_MASK                    0x00001000
#define _AD1CSSL2_CSSL44_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL45_POSITION                0x0000000D
#define _AD1CSSL2_CSSL45_MASK                    0x00002000
#define _AD1CSSL2_CSSL45_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL46_POSITION                0x0000000E
#define _AD1CSSL2_CSSL46_MASK                    0x00004000
#define _AD1CSSL2_CSSL46_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL47_POSITION                0x0000000F
#define _AD1CSSL2_CSSL47_MASK                    0x00008000
#define _AD1CSSL2_CSSL47_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL48_POSITION                0x00000010
#define _AD1CSSL2_CSSL48_MASK                    0x00010000
#define _AD1CSSL2_CSSL48_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL49_POSITION                0x00000011
#define _AD1CSSL2_CSSL49_MASK                    0x00020000
#define _AD1CSSL2_CSSL49_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL50_POSITION                0x00000012
#define _AD1CSSL2_CSSL50_MASK                    0x00040000
#define _AD1CSSL2_CSSL50_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL51_POSITION                0x00000013
#define _AD1CSSL2_CSSL51_MASK                    0x00080000
#define _AD1CSSL2_CSSL51_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL52_POSITION                0x00000014
#define _AD1CSSL2_CSSL52_MASK                    0x00100000
#define _AD1CSSL2_CSSL52_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL53_POSITION                0x00000015
#define _AD1CSSL2_CSSL53_MASK                    0x00200000
#define _AD1CSSL2_CSSL53_LENGTH                  0x00000001

#define _AD1CSSL2_CSSL_POSITION                  0x00000000
#define _AD1CSSL2_CSSL_MASK                      0xFFFFFFFF
#define _AD1CSSL2_CSSL_LENGTH                    0x00000020

#define _AD1CSSL2_w_POSITION                     0x00000000
#define _AD1CSSL2_w_MASK                         0xFFFFFFFF
#define _AD1CSSL2_w_LENGTH                       0x00000020

#define _CVRCON_CVR_POSITION                     0x00000000
#define _CVRCON_CVR_MASK                         0x0000000F
#define _CVRCON_CVR_LENGTH                       0x00000004

#define _CVRCON_CVRSS_POSITION                   0x00000004
#define _CVRCON_CVRSS_MASK                       0x00000010
#define _CVRCON_CVRSS_LENGTH                     0x00000001

#define _CVRCON_CVRR_POSITION                    0x00000005
#define _CVRCON_CVRR_MASK                        0x00000020
#define _CVRCON_CVRR_LENGTH                      0x00000001

#define _CVRCON_CVROE_POSITION                   0x00000006
#define _CVRCON_CVROE_MASK                       0x00000040
#define _CVRCON_CVROE_LENGTH                     0x00000001

#define _CVRCON_ON_POSITION                      0x0000000F
#define _CVRCON_ON_MASK                          0x00008000
#define _CVRCON_ON_LENGTH                        0x00000001

#define _CVRCON_CVR0_POSITION                    0x00000000
#define _CVRCON_CVR0_MASK                        0x00000001
#define _CVRCON_CVR0_LENGTH                      0x00000001

#define _CVRCON_CVR1_POSITION                    0x00000001
#define _CVRCON_CVR1_MASK                        0x00000002
#define _CVRCON_CVR1_LENGTH                      0x00000001

#define _CVRCON_CVR2_POSITION                    0x00000002
#define _CVRCON_CVR2_MASK                        0x00000004
#define _CVRCON_CVR2_LENGTH                      0x00000001

#define _CVRCON_CVR3_POSITION                    0x00000003
#define _CVRCON_CVR3_MASK                        0x00000008
#define _CVRCON_CVR3_LENGTH                      0x00000001

#define _CVRCON_w_POSITION                       0x00000000
#define _CVRCON_w_MASK                           0xFFFFFFFF
#define _CVRCON_w_LENGTH                         0x00000020

#define _CM1CON_CCH_POSITION                     0x00000000
#define _CM1CON_CCH_MASK                         0x00000003
#define _CM1CON_CCH_LENGTH                       0x00000002

#define _CM1CON_CREF_POSITION                    0x00000004
#define _CM1CON_CREF_MASK                        0x00000010
#define _CM1CON_CREF_LENGTH                      0x00000001

#define _CM1CON_EVPOL_POSITION                   0x00000006
#define _CM1CON_EVPOL_MASK                       0x000000C0
#define _CM1CON_EVPOL_LENGTH                     0x00000002

#define _CM1CON_COUT_POSITION                    0x00000008
#define _CM1CON_COUT_MASK                        0x00000100
#define _CM1CON_COUT_LENGTH                      0x00000001

#define _CM1CON_CPOL_POSITION                    0x0000000D
#define _CM1CON_CPOL_MASK                        0x00002000
#define _CM1CON_CPOL_LENGTH                      0x00000001

#define _CM1CON_COE_POSITION                     0x0000000E
#define _CM1CON_COE_MASK                         0x00004000
#define _CM1CON_COE_LENGTH                       0x00000001

#define _CM1CON_ON_POSITION                      0x0000000F
#define _CM1CON_ON_MASK                          0x00008000
#define _CM1CON_ON_LENGTH                        0x00000001

#define _CM1CON_CCH0_POSITION                    0x00000000
#define _CM1CON_CCH0_MASK                        0x00000001
#define _CM1CON_CCH0_LENGTH                      0x00000001

#define _CM1CON_CCH1_POSITION                    0x00000001
#define _CM1CON_CCH1_MASK                        0x00000002
#define _CM1CON_CCH1_LENGTH                      0x00000001

#define _CM1CON_EVPOL0_POSITION                  0x00000006
#define _CM1CON_EVPOL0_MASK                      0x00000040
#define _CM1CON_EVPOL0_LENGTH                    0x00000001

#define _CM1CON_EVPOL1_POSITION                  0x00000007
#define _CM1CON_EVPOL1_MASK                      0x00000080
#define _CM1CON_EVPOL1_LENGTH                    0x00000001

